#----------------------------------------
# Q3: Checker
#----------------------------------------
pos = input().strip()  # รับมามีอย่างน้อย 1 ตัวแน่ ๆ

row = ''
col = ''
if len(pos) <= 3: 
    # แบบที่ 1
    row = ???
    col = ???
else:
    # แบบที่ 2 (กรณีนี้ค่อยทำทีหลังก็ได้ เพราะยุ่งกว่า แต่ให้คะแนนแค่ 20%)
    # หาค่าของตัวอักษรแถว มาใส่ในตัวแปร  row ถ้าหาไม่พบ ก็ให้เป็นสตริงว่าง ๆ
    # หาค่าของเลขคอลัมน์ มาใส่ในตัวแปร  col ถ้าหาไม่พบ ก็ให้เป็นสตริงว่าง ๆ

    row = row    # ในกรณีที่ยังไม่ได้เขียนแบบที่ 2 ก็เขียนคำสั่งนี้ไว้ก่อน (ไม่งั้น ระบบจะฟ้องว่าหลัง else ไม่มีคำสั่ง)



row = row.strip()
col = col.strip()
#-----------------------------------------
valid_row = True
valid_col = True

# ตรวจค่าของสตริง row ถ้าผิด ก็เปลี่ยนตัวแปร valid_row ให้เป็น False




# ตรวจค่าของสตริง col ถ้าผิด ก็เปลี่ยนตัวแปร valid_col ให้เป็น False







#-----------------------------------------  
# ตรวจค่าของตัวแปร valid_row และ valid_col
# เพื่อแสดงข้อผิดพลาด ถ้ามีค่าเป็น False (มี 3 กรณี)
# ถ้าไม่มีข้อผิดพลาด ก็ค่อยตัดสินใจว่าจะแสดง Black หรือ White ตามสีพื้นของช่อง row, col

